AAlx0451/freebsd-manpages-ru/usr/src/bin/domainname/domainname.1
.\"-
.\" Copyright (c) 1983, 1988, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 22, 2013
.Dt DOMAINNAME 1
.Os
.Sh ИМЯ
.Nm domainname
.Nd установка или вывод имени текущего домена YP/NIS
.Sh СИНТАКСИС
.Nm
.Op Ar ypdomain
.Sh ОПИСАНИЕ
Утилита
.Nm
выводит имя текущего домена YP/NIS.
Суперпользователь может установить имя домена, указав аргумент; обычно это делается
с помощью переменной
.Va nisdomainname
в файле
.Pa /etc/rc.conf ,
которая normally устанавливается при загрузке системы.
.Sh ЗАМЕЧАНИЯ
Имя домена YP/NIS (ранее называвшегося «Yellow Pages», но переименованного по юридическим причинам)
не обязательно связано с доменным именем системы доменных имён (DNS), хотя для удобства администрирования
их часто устанавливают одинаковыми.
.Sh СМ. ТАКЖЕ
.Xr getdomainname 3 ,
.Xr rc.conf 5
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.Fx 1.1 ,
основываясь на аналогичной команде в
.Tn SunOS .
