AAlx0451/freebsd-manpages-ru/usr/src/bin/freebsd-version/freebsd-version.1
.\"-
.\" Copyright (c) 2013 Dag-Erling Smørgrav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 27, 2025
.Dt FREEBSD-VERSION 1
.Os
.Sh ИМЯ
.Nm freebsd-version
.Nd вывод версии и уровня исправлений установленной системы
.Sh СИНТАКСИС
.Nm
.Op Fl kru
.Op Fl j Ar jail
.Sh ОПИСАНИЕ
Утилита
.Nm
прилагает все усилия для определения версии и уровня исправлений (patch level)
установленного ядра и/или пользовательского окружения.
.Pp
Доступны следующие параметры:
.Bl -tag -width Fl
.It Fl k
Вывести версию и уровень исправлений установленного ядра.
В отличие от
.Xr uname 1 ,
если новое ядро было установлено, но система ещё не перезагружалась,
.Nm
выведет версию и уровень исправлений нового ядра.
.It Fl r
Вывести версию и уровень исправлений работающего ядра.
В отличие от
.Xr uname 1 ,
на это не влияют переменные окружения.
.It Fl u
Вывести версию и уровень исправлений установленного пользовательского окружения.
Эти значения жёстко заданы в
.Nm
во время сборки.
.It Fl j Ar jail
Вывести версию и уровень исправлений пользовательского окружения в указанной
изолированной среде (jail), заданной
.Va jid
или
.Va name .
Этот параметр может быть указан несколько раз.
.El
.Pp
Если указано несколько из вышеперечисленных параметров,
.Nm
выведет сначала версию установленного ядра, затем версию работающего ядра,
далее версию пользовательского окружения и, наконец, версию пользовательского окружения
указанных изолированных сред, каждую на отдельной строке.
Если параметры не указаны, будет выведена только версия пользовательского окружения.
.Sh ЗАМЕЧАНИЯ ПО РЕАЛИЗАЦИИ
Утилита
.Nm
должна давать правильный ответ в подавляющем большинстве случаев,
включая системы, обновляемые с помощью
.Xr freebsd-update 8 ,
который не обновляет версию ядра, если только само ядро не было затронуто последним исправлением.
.Pp
Чтобы определить имя (и, следовательно, расположение) пользовательского ядра,
утилита
.Nm
пытается проанализировать
.Pa /boot/defaults/loader.conf
и
.Pa /boot/loader.conf ,
ища определения переменных
.Va kernel
и
.Va bootfile ,
обе из которых по умолчанию имеют значение
.Dq kernel .
Однако ей может не удаться найти правильное ядро, если одна или обе из этих переменных
определены в нестандартном месте, например, в
.Pa /boot/loader.rc .
.Sh ОКРУЖЕНИЕ
.Bl -tag -width ROOT
.It Ev ROOT
Путь к корню файловой системы, в которой следует искать
.Pa loader.conf
и ядро.
.El
.Sh ПРИМЕРЫ
Чтобы определить версию работающего пользовательского окружения:
.Bd -literal -offset indent
/bin/freebsd-version -u
.Ed
.Pp
Чтобы проверить систему, восстанавливаемую с помощью работающей системы:
.Bd -literal -offset indent
mount -rt ufs /dev/ada0p2 /mnt
env ROOT=/mnt /mnt/bin/freebsd-version -ku
.Ed
.Sh СМ. ТАКЖЕ
.Xr uname 1 ,
.Xr loader.conf 5
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.Fx 10.0 .
.Sh АВТОРЫ
Утилита
.Nm
и эта страница руководства были написаны
.An Dag-Erling Sm\(/orgrav Aq Mt des@FreeBSD.org .
