AAlx0451/freebsd-manpages-ru/usr/src/bin/df/df.1
.\"-
.\" Copyright (c) 1989, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 16, 2025
.Dt DF 1
.Os
.Sh ИМЯ
.Nm df
.Nd отображение свободного дискового пространства
.Sh СИНТАКСИС
.Nm
.Op Fl -libxo
.Op Fl b | g | H | h | k | m | P
.Op Fl acilnT
.Op Fl \&,
.Op Fl t Ar тип
.Op Ar файл | файловая_система ...
.Sh ОПИСАНИЕ
Утилита
.Nm
отображает статистику о количестве свободного дискового пространства на указанной смонтированной
.Ar файловой_системе
или на файловой системе, частью которой является
.Ar файл .
По умолчанию количество блоков отображается в предположении, что размер блока равен 512 байт.
Если не указан ни файл, ни операнд файловой системы,
отображается статистика для всех смонтированных файловых систем
(с учётом параметра
.Fl t
ниже).
.Pp
Доступны следующие параметры:
.Bl -tag -width indent
.It Fl -libxo
Генерировать вывод через
.Xr libxo 3
в одном из различных человеко-читаемых и машино-читаемых форматов.
См.
.Xr xo_options 7
для подробной информации об аргументах командной строки.
.It Fl a
Показывать все точки монтирования, включая те, которые были смонтированы с флагом
.Dv MNT_IGNORE .
Это подразумевается для файловых систем, указанных в командной строке.
.It Fl b
Явно использовать блоки размером 512 байт, переопределяя любые настройки
.Ev BLOCKSIZE
из окружения.
Это то же самое, что и параметр
.Fl P .
Параметр
.Fl k
переопределяет этот параметр.
.It Fl c
Отобразить общий итог (grand total).
.It Fl g
Использовать блоки по 1073741824 байт (1 гибибайт) вместо блоков по умолчанию.
Это переопределяет любые настройки
.Ev BLOCKSIZE
из окружения.
.It Fl h
"Человеко-читаемый" вывод.
Использовать суффиксы единиц: Byte, Kibibyte, Mebibyte, Gibibyte, Tebibyte и
Pebibyte (на основе степеней 1024) для сокращения количества цифр до четырёх или менее.
.It Fl H , Fl Fl si
То же, что и
.Fl h ,
но на основе степеней 1000.
.It Fl i
Включать статистику по количеству свободных и используемых инодов.
В сочетании с параметрами
.Fl h
или
.Fl H
количество инодов масштабируется степенями 1000.
Если в файловой системе нет инодов, вместо процента использования отображается
.Sq - .
.It Fl k
Использовать блоки по 1024 байт (1 кибибайт) вместо блоков по умолчанию.
Это переопределяет параметр
.Fl P
и любые настройки
.Ev BLOCKSIZE
из окружения.
.It Fl l
Выбрать для отображения только локально смонтированные файловые системы.
При использовании в сочетании с параметром
.Fl t Ar тип
типы файловых систем будут добавлены или исключены в соответствии с параметрами этого параметра.
.It Fl m
Использовать блоки по 1048576 байт (1 мебибайт) вместо блоков по умолчанию.
Это переопределяет любые настройки
.Ev BLOCKSIZE
из окружения.
.It Fl n
Вывести ранее полученную статистику файловых систем.
Этот параметр следует использовать, если возможно, что одна или несколько
файловых систем находятся в состоянии, когда они не могут предоставить
статистику без длительной задержки.
Когда указан этот параметр,
.Nm
не будет запрашивать новую статистику у файловых систем, а ответит,
возможно, устаревшей статистикой, полученной ранее.
.It Fl P
Явно использовать блоки по 512 байт, переопределяя любые настройки
.Ev BLOCKSIZE
из окружения.
Это то же самое, что и параметр
.Fl b .
Параметр
.Fl k
переопределяет этот параметр.
.It Fl t Ar тип
Выбрать файловые системы для отображения.
Может быть указано более одного типа через запятую.
Списку типов файловых систем может предшествовать префикс
.Dq no ,
чтобы указать типы файловых систем, для которых действие должно
.Em не
выполняться.
При использовании в сочетании с параметром
.Fl l
параметры этого параметра изменят список локально смонтированных
файловых систем, выбранных параметром
.Fl l .
Например, команда
.Nm :
.Bd -literal -offset indent
df -t nonfs,nullfs
.Ed
.Pp
выводит все файловые системы, кроме типов NFS и NULLFS.
Команда
.Xr lsvfs 1
может быть использована для выяснения типов файловых систем,
доступных в системе.
.It Fl T
Включать тип файловой системы.
.It Fl ,
(Запятая) Выводить размеры, сгруппированными и разделёнными тысячами,
используя неденежный разделитель, возвращаемый
.Xr localeconv 3 ,
обычно запятую или точку.
Если локаль не установлена или в локали нет неденежного разделителя,
этот параметр не имеет эффекта.
.El
.Sh ОКРУЖЕНИЕ
.Bl -tag -width BLOCKSIZE
.It Ev BLOCKSIZE
Определяет единицы, в которых выводятся счётчики блоков.
Используется
.Xr getbsize 3 ,
которая позволяет задать единицы в байтах или числа, масштабируемые буквами
.Em k
(для кратных 1024 байтам),
.Em m
(для кратных 1048576 байтам) или
.Em g
(для гибибайт).
Допустимый диапазон — от 512 байт до 1 ГБ.
Если значение выходит за пределы, оно устанавливается в соответствующую границу.
.El
.Sh ПРИМЕРЫ
Показать свободное дисковое пространство в человеко-читаемом виде для всех точек монтирования,
включая тип файловой системы:
.Bd -literal -offset indent
$ df -ahT
Filesystem   Type        Size    Used   Avail Capacity  Mounted on
/dev/ada1p2  ufs         213G    152G     44G    78%    /
devfs        devfs       1.0K    1.0K      0B   100%    /dev
/dev/ada0p1  ufs         1.8T    168G    1.5T    10%    /data
linsysfs     linsysfs    4.0K    4.0K      0B   100%    /compat/linux/sys
/dev/da0     msdosfs     7.6G    424M    7.2G     5%    /mnt/usb
.Ed
.Pp
Показать ранее собранные данные, включая статистику по инодам, за исключением файловых систем
типа devfs или linsysfs. Обратите внимание, что префикс
.Dq no
влияет на все файловые системы в списке, и параметр
.Fl t
может быть указан только один раз:
.Bd -literal -offset indent
$ df -i -n -t nodevfs,linsysfs
Filesystem   1K-blocks      Used      Avail Capacity iused     ifree %iused
Mounted on
/dev/ada1p2  223235736 159618992   45757888    78% 1657590  27234568    6%   /
/dev/ada0p1 1892163184 176319420 1564470712    10% 1319710 243300576    1%
/data
/dev/da0       7989888    433664    7556224     5%       0         0  100%
/mnt/usb
.Ed
.Pp
Показать информацию в человеко-читаемом виде для файловой системы, содержащей файл
.Pa /etc/rc.conf :
.Bd -literal -offset indent
$ df -h /etc/rc.conf
Filesystem     Size    Used   Avail Capacity  Mounted on
/dev/ada1p2    213G    152G     44G    78%    /
.Ed
.Pp
То же, что и выше, но с указанием конкретной файловой системы:
.Bd -literal -offset indent
$ df -h /dev/ada1p2
Filesystem     Size    Used   Avail Capacity  Mounted on
/dev/ada1p2    213G    152G     44G    78%    /
.Ed
.Sh ЗАМЕЧАНИЯ
Для не-Unix файловых систем сообщаемые значения используемых и свободных инодов
могут иметь иной смысл, чем количество используемых и доступных файлов и каталогов.
Примером является msdosfs: в случае файловых систем FAT12 или FAT16
сообщается количество доступных и свободных записей корневого каталога вместо инодов
.Po
где для хранения каждого имени файла, каталога или метки диска требуется
от 1 до 21 таких записей каталога
.Pc .
.Sh СМ. ТАКЖЕ
.Xr lsvfs 1 ,
.Xr quota 1 ,
.Xr fstatfs 2 ,
.Xr getfsstat 2 ,
.Xr statfs 2 ,
.Xr getbsize 3 ,
.Xr getmntinfo 3 ,
.Xr libxo 3 ,
.Xr localeconv 3 ,
.Xr xo_options 7 ,
.Xr fstab 5 ,
.Xr mount 8 ,
.Xr pstat 8 ,
.Xr quot 8 ,
.Xr swapinfo 8
.Sh СТАНДАРТЫ
За исключением большинства параметров,
утилита
.Nm
соответствует стандарту
.St -p1003.1-2004 ,
который определяет только параметры
.Fl k , P
и
.Fl t .
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.At v1 .
.Sh ОШИБКИ (BUGS)
Флаг
.Fl n
игнорируется, если указан файл или файловая система.
Кроме того, если точка монтирования недоступна пользователю,
информация о файловой системе может быть устаревшей.
.Pp
Параметры
.Fl b
и
.Fl P
идентичны.
Первый пришёл из традиции BSD, а второй требуется для соответствия
.St -p1003.1-2004 .
