AAlx0451/freebsd-manpages-ru/usr/src/bin/dd/dd.1
.\"-
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Keith Muller of the University of California, San Diego.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 4, 2020
.Dt DD 1
.Os
.Sh ИМЯ
.Nm dd
.Nd преобразование и копирование файла
.Sh СИНТАКСИС
.Nm
.Op Ar операнды ...
.Sh ОПИСАНИЕ
Утилита
.Nm
копирует стандартный ввод на стандартный вывод.
Входные данные читаются и записываются блоками по 512 байт.
Если при чтении получено меньше данных, чем размер блока, данные из нескольких операций чтения
агрегируются для формирования выходного блока.
По завершении
.Nm
выводит в стандартный поток ошибок количество полных и частичных входных и выходных блоков,
а также усечённых входных записей.
.Pp
Доступны следующие операнды:
.Bl -tag -width "of=file"
.It Cm bs Ns = Ns Ar n
Установить размер и входного, и выходного блока в
.Ar n
байт, заменяя операнды
.Cm ibs
и
.Cm obs .
Если не указаны значения преобразования, кроме
.Cm noerror ,
.Cm notrunc
или
.Cm sync ,
то каждый входной блок копируется в выходной как один блок без какого-либо агрегирования коротких блоков.
.It Cm cbs Ns = Ns Ar n
Установить размер записи преобразования в
.Ar n
байт.
Размер записи преобразования требуется для преобразований, ориентированных на записи.
.It Cm count Ns = Ns Ar n
Скопировать только
.Ar n
входных блоков.
.It Cm files Ns = Ns Ar n
Скопировать
.Ar n
входных файлов перед завершением.
Этот операнд применим только когда устройство ввода является лентой.
.It Cm fillchar Ns = Ns Ar c
При дополнении блока в режиме преобразования или из-за использования режимов
.Cm noerror
и
.Cm sync
заполнять его указанным
.Tn ASCII
символом вместо пробела или
.Dv NUL .
.It Cm ibs Ns = Ns Ar n
Установить размер входного блока в
.Ar n
байт вместо 512 по умолчанию.
.It Cm if Ns = Ns Ar file
Читать ввод из
.Ar file
вместо стандартного ввода.
.It Cm iflag Ns = Ns Ar значение Ns Op , Ns Ar значение ...
Где
.Cm значение
— один из символов следующего списка.
.Bl -tag -width "fullblock"
.It Cm fullblock
Чтение из входного файла может не дать полного блока.
Если чтение вернуло меньше данных, продолжить чтение, чтобы заполнить блок.
Без этого флага
.Cm count
ограничивает количество вызовов
.Xr read 2
для ввода, а не количество полностью скопированных блоков.
Не может сочетаться с
.Cm conv=sync .
.It Cm direct
Установить флаг O_DIRECT для входного файла, чтобы чтение обходило локальное кэширование.
.El
.It Cm iseek Ns = Ns Ar n
Переместиться во входном файле на
.Ar n
блоков.
Это синоним
.Cm skip Ns = Ns Ar n .
.It Cm obs Ns = Ns Ar n
Установить размер выходного блока в
.Ar n
байт вместо 512 по умолчанию.
.It Cm of Ns = Ns Ar file
Записывать вывод в
.Ar file
вместо стандартного вывода.
Любой обычный выходной файл усекается, если не указано значение преобразования
.Cm notrunc .
Если начальная часть выходного файла пропущена (см. операнд
.Cm oseek ),
выходной файл усекается в этой точке.
.It Cm oflag Ns = Ns Ar значение Ns Op , Ns Ar значение ...
Где
.Cm значение
— один из символов следующего списка.
.Bl -tag -width "direct"
.It Cm fsync
Установить флаг O_FSYNC для выходного файла, чтобы запись выполнялась синхронно.
.It Cm sync
Установить флаг O_SYNC для выходного файла, чтобы запись выполнялась синхронно.
Это синоним значения
.Cm fsync .
.It Cm direct
Установить флаг O_DIRECT для выходного файла, чтобы запись обходила локальное кэширование.
.El
.It Cm oseek Ns = Ns Ar n
Переместиться в выходном файле на
.Ar n
блоков.
Это синоним
.Cm seek Ns = Ns Ar n .
.It Cm seek Ns = Ns Ar n
Переместиться на
.Ar n
блоков от начала вывода перед копированием.
На устройствах, не являющихся лентами, используется операция
.Xr lseek 2 .
В противном случае существующие блоки читаются, а данные отбрасываются.
Если пользователь не имеет права чтения для ленты, позиционирование выполняется с помощью
функций
.Xr ioctl 2
для ленты.
Если операция позиционирования выходит за конец файла, пространство от текущего конца
файла до указанного смещения заполняется блоками из байтов
.Dv NUL .
.It Cm skip Ns = Ns Ar n
Пропустить
.Ar n
блоков от начала ввода перед копированием.
Для ввода, поддерживающего позиционирование, используется операция
.Xr lseek 2 .
В противном случае входные данные читаются и отбрасываются.
Для каналов читается корректное количество байт.
Для всех остальных устройств читается корректное количество блоков без различения
между частично или полностью прочитанным блоком.
.It Cm speed Ns = Ns Ar n
Ограничить скорость копирования до
.Ar n
байт в секунду.
.It Cm status Ns = Ns Ar значение
Где
.Cm значение
— один из символов следующего списка.
.Bl -tag -width "progress"
.It Cm noxfer
Не выводить статистику передачи в последней строке выходного статуса.
.It Cm none
Не выводить выходной статус.
Сообщения об ошибках показываются; информационные сообщения — нет.
.It Cm progress
Выводить базовую статистику передачи раз в секунду.
.El
.It Cm conv Ns = Ns Ar значение Ns Op , Ns Ar значение ...
Где
.Cm значение
— один из символов следующего списка.
.Bl -tag -width "unblock"
.It Cm ascii , oldascii
То же, что и значение
.Cm unblock ,
за исключением того, что символы преобразуются из
.Tn EBCDIC
в
.Tn ASCII
перед преобразованием записей.
(Эти значения подразумевают
.Cm unblock ,
если также указан операнд
.Cm cbs . )
Существует две карты преобразования для
.Tn ASCII .
Значение
.Cm ascii
задаёт рекомендуемую карту, совместимую с
.At V .
Значение
.Cm oldascii
задаёт карту, использовавшуюся в исторических
.At
и системах до
.Bx 4.3 reno .
.It Cm block
Обрабатывает ввод как последовательность записей переменной длины, ограниченных символами
новой строки или концом файла, независимо от границ входных и выходных блоков.
Любой завершающий символ новой строки отбрасывается.
Каждая входная запись преобразуется в выходную запись фиксированной длины,
которая задаётся операндом
.Cm cbs .
Входные записи короче размера записи преобразования дополняются пробелами.
Входные записи длиннее размера записи преобразования усекаются.
Количество усечённых входных записей (если они есть) сообщается в стандартный поток ошибок
по завершении копирования.
.It Cm ebcdic , ibm , oldebcdic , oldibm
То же, что и значение
.Cm block ,
за исключением того, что символы преобразуются из
.Tn ASCII
в
.Tn EBCDIC
после преобразования записей.
(Эти значения подразумевают
.Cm block ,
если также указан операнд
.Cm cbs . )
Существует четыре карты преобразования для
.Tn EBCDIC .
Значение
.Cm ebcdic
задаёт рекомендуемую карту, совместимую с
.At V .
Значение
.Cm ibm
задаёт несколько иное отображение, совместимое со значением
.Cm ibm
из
.At V .
Значения
.Cm oldebcdic
и
.Cm oldibm
— это карты, использовавшиеся в исторических
.At
и системах до
.Bx 4.3 reno .
.It Cm fdatasync
Выполнить
.Xr fdatasync 2
для выходного файла перед его закрытием.
.It Cm fsync
Выполнить
.Xr fsync 2
для выходного файла перед его закрытием.
.It Cm lcase
Преобразовать прописные символы в строчные.
.It Cm pareven , parnone , parodd , parset
Выводить данные с указанной чётностью.
Бит чётности во входных данных удаляется, если только также не задано преобразование
из
.Tn EBCDIC
в
.Tn ASCII .
.It Cm noerror
Не прекращать обработку при ошибке ввода.
При возникновении ошибки ввода диагностическое сообщение, за которым следуют текущие
счётчики входных и выходных блоков, будет записано в стандартный поток ошибок в том же
формате, что и стандартное сообщение о завершении.
Если также указано преобразование
.Cm sync ,
любые недостающие входные данные будут заменены байтами
.Dv NUL
(или пробелами, если было указано блочно-ориентированное преобразование) и обработаны
как обычный входной буфер.
Если указан параметр
.Cm fillchar ,
символ заполнения, заданный в командной строке, отменяет автоматический выбор
символа заполнения.
Если преобразование
.Cm sync
не указано, входной блок пропускается при выводе.
Для входных файлов, не являющихся лентами или каналами, смещение в файле
будет установлено за блок, в котором произошла ошибка, с помощью
.Xr lseek 2 .
.It Cm notrunc
Не усекать выходной файл.
Это сохранит любые блоки в выходном файле, которые не были явно записаны
.Nm .
Значение
.Cm notrunc
не поддерживается для лент.
.It Cm osync
Дополнить последний выходной блок до полного размера выходного блока.
Если входной файл после преобразования не кратен размеру выходного блока,
это преобразование заставляет последний выходной блок иметь тот же размер,
что и предыдущие блоки, для использования на устройствах, требующих записи
блоков регулярного размера.
Эта опция несовместима с использованием спецификации размера блока
.Cm bs Ns = Ns Ar n .
.It Cm sparse
Если один или несколько выходных блоков должны состоять только из байтов
.Dv NUL ,
попытаться выполнить позиционирование в выходном файле на требуемое пространство
вместо заполнения его байтами
.Dv NUL ,
что приводит к созданию разрежённого файла (sparse file).
.It Cm swab
Поменять местами каждую пару входных байтов.
Если входной буфер содержит нечётное количество байтов, последний байт будет
проигнорирован при обмене.
.It Cm sync
Дополнить каждый входной блок до размера входного буфера.
Для дополнения используются пробелы, если указано блочно-ориентированное преобразование,
в противном случае — байты
.Dv NUL .
.It Cm ucase
Преобразовать строчные символы в прописные.
.It Cm unblock
Обрабатывает ввод как последовательность записей фиксированной длины независимо
от границ входных и выходных блоков.
Длина входных записей задаётся операндом
.Cm cbs .
Любые завершающие пробелы отбрасываются, и добавляется символ новой строки.
.El
.El
.Pp
Когда указываются размеры или скорость, ожидается десятичное, восьмеричное или
шестнадцатеричное число байтов.
Если число оканчивается на
.Dq Li b ,
.Dq Li k ,
.Dq Li m ,
.Dq Li g ,
.Dq Li t ,
.Dq Li p
или
.Dq Li w ,
оно умножается соответственно на 512, 1024 (1K), 1048576 (1M), 1073741824 (1G),
1099511627776 (1T), 1125899906842624 (1P) или количество байтов в целом числе.
Два или более числа могут быть разделены
.Dq Li x
для обозначения произведения.
.Pp
По завершении
.Nm
выводит в стандартный поток ошибок количество полных и частичных входных и выходных блоков,
усечённых входных записей и блоков с нечётной длиной при байт-свопинге.
Частичный входной блок — это блок, в котором прочитано меньше, чем размер входного блока.
Частичный выходной блок — это блок, в котором записано меньше, чем размер выходного блока.
Частичные выходные блоки для ленточных устройств считаются фатальными ошибками.
В противном случае остальная часть блока будет записана.
Частичные выходные блоки для символьных устройств выдают предупреждение.
Усечённый входной блок — это блок, для которого было указано преобразование,
ориентированное на записи переменной длины, и входная строка была слишком длинной,
чтобы поместиться в запись преобразования, или не заканчивалась символом новой строки.
.Pp
Обычно данные, полученные в результате ввода, преобразования или того и другого,
агрегируются в выходные блоки указанного размера.
После достижения конца ввода все оставшиеся данные записываются как блок.
Это означает, что последний выходной блок может быть короче размера выходного блока.
.Pp
Если
.Nm
получает сигнал
.Dv SIGINFO
(см. аргумент
.Cm status
команды
.Xr stty 1 ) ,
текущие счётчики входных и выходных блоков будут записаны в стандартный поток ошибок
в том же формате, что и стандартное сообщение о завершении.
Если
.Nm
получает сигнал
.Dv SIGINT ,
текущие счётчики входных и выходных блоков будут записаны в стандартный поток ошибок
в том же формате, что и стандартное сообщение о завершении, после чего
.Nm
завершит работу.
.Sh КОД ЗАВЕРШЕНИЯ
.Ex -std
.Sh ПРИМЕРЫ
Проверить, что диск не содержит сбойных блоков:
.Pp
.Dl "dd if=/dev/ada0 of=/dev/null bs=1m"
.Pp
Освежить данные на диске, чтобы предотвратить прогрессирование восстановимых
ошибок чтения в невосстановимые:
.Pp
.Dl "dd if=/dev/ada0 of=/dev/ada0 bs=1m"
.Pp
Удалить бит чётности из файла:
.Pp
.Dl "dd if=file conv=parnone of=file.txt"
.Pp
Проверить наличие ошибок чётности (чётной) в файле:
.Pp
.Dl "dd if=file conv=pareven | cmp -x - file"
.Pp
Чтобы создать образ CD-ROM в формате Mode-1 (обычно используется для дисков с данными),
используйте размер блока 2048 байт:
.Pp
.Dl "dd if=/dev/cd0 of=filename.iso bs=2048"
.Pp
Записать образ файловой системы на флеш-накопитель, при необходимости дополнив
конец нулями до границы 1 МиБ:
.Pp
.Dl "dd if=memstick.img of=/dev/da0 bs=1m conv=noerror,sync"
.Sh СМ. ТАКЖЕ
.Xr cp 1 ,
.Xr mt 1 ,
.Xr recoverdisk 1 ,
.Xr tr 1 ,
.Xr geom 4 ,
.Xr trim 8
.Sh СТАНДАРТЫ
Утилита
.Nm
должна быть надмножеством стандарта
.St -p1003.2 .
Операнды
.Cm files
и
.Cm status ,
а также значения
.Cm ascii ,
.Cm ebcdic ,
.Cm ibm ,
.Cm oldascii ,
.Cm oldebcdic
и
.Cm oldibm
являются расширениями стандарта
.Tn POSIX .
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.At v5 .
.Sh ОШИБКИ (BUGS)
Механизмы защиты в подсистеме
.Xr geom 4
могут препятствовать записи блоков на диск даже суперпользователем.
Инструкции по временному отключению этих механизмов защиты можно найти
на странице руководства
.Xr geom 4 .
