AAlx0451/freebsd-manpages-ru/usr/src/bin/dd/dd.1
.\"-
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Keith Muller of the University of California, San Diego.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd 4 июня 2020
.Dt DD 1
.Os
.Sh ИМЯ
.Nm dd
.Nd преобразование и копирование файла
.Sh СИНТАКСИС
.Nm
.Op Ar operands ...
.Sh ОПИСАНИЕ
Утилита
.Nm
копирует стандартный ввод в стандартный вывод.
Входные данные считываются и записываются блоками по 512 байт.
Если операции чтения из входного потока возвращают блоки неполного размера, данные из нескольких операций чтения объединяются для формирования выходного блока.
После завершения работы
.Nm
выводит количество полных и частичных входных и выходных блоков, а также усечённых входных записей в стандартный поток ошибок.
.Pp
Доступны следующие операнды:
.Bl -tag -width "of=file"
.It Cm bs Ns = Ns Ar n
Установить размер как входного, так и выходного блока равным
.Ar n
байт, заменяя операнды
.Cm ibs
и
.Cm obs .
Если не указаны другие значения преобразования, кроме
.Cm noerror ,
.Cm notrunc
или
.Cm sync ,
то каждый входной блок копируется в выходной поток как один блок без какого-либо объединения коротких блоков.
.It Cm cbs Ns = Ns Ar n
Установить размер записи преобразования равным
.Ar n
байт.
Размер записи преобразования требуется для ориентированных на записи значений преобразования.
.It Cm count Ns = Ns Ar n
Скопировать только
.Ar n
входных блоков.
.It Cm files Ns = Ns Ar n
Скопировать
.Ar n
входных файлов перед завершением работы.
Этот операнд применим только в том случае, если входным устройством является магнитная лента.
.It Cm fillchar Ns = Ns Ar c
При дополнении блока в режиме преобразования или из-за использования режимов
.Cm noerror
и
.Cm sync ,
заполнять его указанным символом
.Tn ASCII
вместо использования пробела или символа
.Dv NUL .
.It Cm ibs Ns = Ns Ar n
Установить размер входного блока равным
.Ar n
байт вместо значения по умолчанию 512.
.It Cm if Ns = Ns Ar file
Читать входные данные из файла
.Ar file
вместо стандартного ввода.
.It Cm iflag Ns = Ns Ar value Ns Op , Ns Ar value ...
Где значение
.Cm value
представляет собой один из символов из следующего списка:
.Bl -tag -width "fullblock"
.It Cm fullblock
Чтение из входного файла может не вернуть полный блок.
Если чтение возвращает блок неполного размера, продолжать чтение для заполнения блока.
Без этого флага операнд
.Cm count
ограничивает количество вызовов системного вызова
.Xr read 2
для ввода, а не количество полностью скопированных блоков.
Не может сочетаться с
.Cm conv=sync .
.It Cm direct
Установить флаг O_DIRECT для входного файла, чтобы операции чтения обходили любое локальное кэширование.
.El
.It Cm iseek Ns = Ns Ar n
Выполнить смещение во входном файле на
.Ar n
блоков.
Это синоним операнда
.Cm skip Ns = Ns Ar n .
.It Cm obs Ns = Ns Ar n
Установить размер выходного блока равным
.Ar n
байт вместо значения по умолчанию 512.
.It Cm of Ns = Ns Ar file
Записывать выходные данные в файл
.Ar file
вместо стандартного вывода.
Любой обычный выходной файл усекается, если только не указано значение преобразования
.Cm notrunc .
Если начальная часть выходного файла пропускается при смещении (см. операнд
.Cm oseek ) ,
выходной файл усекается в этой точке.
.It Cm oflag Ns = Ns Ar value Ns Op , Ns Ar value ...
Где значение
.Cm value
представляет собой один из символов из следующего списка:
.Bl -tag -width "direct"
.It Cm fsync
Установить флаг O_FSYNC для выходного файла, чтобы операции записи выполнялись синхронно.
.It Cm sync
Установить флаг O_SYNC для выходного файла, чтобы операции записи выполнялись синхронно.
Это синоним значения
.Cm fsync .
.It Cm direct
Установить флаг O_DIRECT для выходного файла, чтобы операции записи обходили любое локальное кэширование.
.El
.It Cm oseek Ns = Ns Ar n
Выполнить смещение в выходном файле на
.Ar n
блоков.
Это синоним операнда
.Cm seek Ns = Ns Ar n .
.It Cm seek Ns = Ns Ar n
Пропустить (сдвинуть позицию на)
.Ar n
блоков от начала выходного файла перед копированием.
На устройствах, отличных от магнитных лент, используется операция системного вызова
.Xr lseek 2 .
В противном случае существующие блоки считываются, а данные отбрасываются.
Если у пользователя нет прав на чтение ленты, её позиционирование выполняется с помощью вызовов функции
.Xr ioctl 2
для магнитных лент.
Если операция смещения выходит за конец файла, пространство от текущего конца файла до указанного смещения заполняется блоками из байтов
.Dv NUL .
.It Cm skip Ns = Ns Ar n
Пропустить (сдвинуть позицию на)
.Ar n
блоков от начала входного файла перед копированием.
Если входной поток поддерживает смещение, используется операция системного вызова
.Xr lseek 2 .
В противном случае входные данные считываются и отбрасываются.
Для каналов (pipes) считывается точное количество байт.
Для всех остальных устройств считывается точное количество блоков без различия между чтением частичного или полного блока.
.It Cm speed Ns = Ns Ar n
Ограничить скорость копирования до
.Ar n
байт в секунду.
.It Cm status Ns = Ns Ar value
Где значение
.Cm value
представляет собой один из символов из следующего списка:
.Bl -tag -width "progress"
.It Cm noxfer
Не выводить статистику передачи в качестве последней строки вывода статуса.
.It Cm none
Не выводить статусную информацию.
Сообщения об ошибках отображаются, а информационные сообщения — нет.
.It Cm progress
Выводить базовую статистику передачи каждую секунду.
.El
.It Cm conv Ns = Ns Ar value Ns Op , Ns Ar value ...
Где значение
.Cm value
представляет собой один из символов из следующего списка:
.Bl -tag -width "unblock"
.It Cm ascii , oldascii
То же, что и значение
.Cm unblock ,
за исключением того, что символы преобразуются из кодировки
.Tn EBCDIC
в кодировку
.Tn ASCII
перед преобразованием записей.
(Эти значения подразумевают режим
.Cm unblock ,
если также указан операнд
.Cm cbs . )
Существует две таблицы преобразования для
.Tn ASCII .
Значение
.Cm ascii
указывает рекомендуемую таблицу, совместимую с
.At V .
Значение
.Cm oldascii
указывает таблицу, использовавшуюся в исторических системах
.At
и системах, предшествующих
.No pre- Ns Bx 4.3 reno .
.It Cm block
Рассматривает входной поток как последовательность записей переменной длины, завершающихся символом новой строки или символом конца файла, независимо от границ входных и выходных блоков.
Любой конечный символ новой строки отбрасывается.
Каждая входная запись преобразуется в выходную запись фиксированной длины, размер которой задаётся операндом
.Cm cbs .
Входные записи, размер которых меньше размера записи преобразования, дополняются пробелами.
Входные записи, размер которых больше размера записи преобразования, усекаются.
Количество усечённых входных записей, если таковые имеются, выводится в стандартный поток ошибок по завершении копирования.
.It Cm ebcdic , ibm , oldebcdic , oldibm
То же, что и значение
.Cm block ,
за исключением того, что символы преобразуются из кодировки
.Tn ASCII
в кодировку
.Tn EBCDIC
после преобразования записей.
(Эти значения подразумевают режим
.Cm block ,
если также указан операнд
.Cm cbs . )
Существует четыре таблицы преобразования для
.Tn EBCDIC .
Значение
.Cm ebcdic
указывает рекомендуемую таблицу, совместимую с
.At V .
Значение
.Cm ibm
представляет собой немного отличающуюся таблицу, совместимую со значением
.Cm ibm
в
.At V .
Значения
.Cm oldebcdic
и
.Cm oldibm
представляют собой таблицы, использовавшиеся в исторических системах
.At
и системах, предшествующих
.No pre- Ns Bx 4.3 reno .
.It Cm fdatasync
Выполнить системный вызов
.Xr fdatasync 2
для выходного файла перед его закрытием.
.It Cm fsync
Выполнить системный вызов
.Xr fsync 2
для выходного файла перед его закрытием.
.It Cm lcase
Преобразовать символы верхнего регистра в символы нижнего регистра.
.It Cm pareven , parnone , parodd , parset
Выводить данные с указанным контролем чётности.
Бит чётности на входе удаляется, если только также не указано преобразование из
.Tn EBCDIC
в
.Tn ASCII .
.It Cm noerror
Не останавливать обработку при ошибке чтения.
При возникновении ошибки чтения диагностическое сообщение, за которым следует текущее количество входных и выходных блоков, будет записано в стандартный поток ошибок в том же формате, что и стандартное сообщение о завершении работы.
Если также указано преобразование
.Cm sync ,
любые отсутствующие входные данные будут заменены байтами
.Dv NUL
(или пробелами, если было указано блочно-ориентированное значение преобразования) и обработаны как обычный входной буфер.
Если указана опция
.Cm fillchar ,
символ заполнения, переданный в командной строке, переопределит автоматический выбор символа заполнения.
Если преобразование
.Cm sync
не указано, дефектный входной блок пропускается в выходном потоке.
Для входных файлов, не являющихся магнитными лентами или каналами, смещение файла будет установлено за блоком, в котором произошла ошибка, с помощью системного вызова
.Xr lseek 2 .
.It Cm notrunc
Не усекать выходной файл.
Это сохранит любые блоки в выходном файле, которые не были явно перезаписаны утилитой
.Nm .
Значение
.Cm notrunc
не поддерживается для магнитных лент.
.It Cm osync
Дополнить последний выходной блок до полного размера выходного блока.
Если размер входного файла после преобразования не кратен размеру выходного блока, это преобразование принудительно устанавливает размер последнего выходного блока равным размеру предыдущих блоков для использования на устройствах, требующих записи блоков одинакового размера.
Эта опция несовместима с использованием спецификации размера блока
.Cm bs Ns = Ns Ar n .
.It Cm sparse
Если один или несколько выходных блоков состоят исключительно из байтов
.Dv NUL ,
попытаться выполнить смещение в выходном файле на требуемый объём пространства вместо заполнения их байтами
.Dv NUL ,
что приводит к созданию разрежённого (sparse) файла.
.It Cm swab
Переставить местами каждую пару входных байт.
Если входной буфер содержит нечётное количество байт, последний байт игнорируется при перестановке.
.It Cm sync
Дополнить каждый входной блок до размера входного буфера.
Если указано блочно-ориентированное значение преобразования, в качестве заполняющих байтов используются пробелы, в противном случае используются байты
.Dv NUL .
.It Cm ucase
Преобразовать символы нижнего регистра в символы верхнего регистра.
.It Cm unblock
Рассматривает входной поток как последовательность записей фиксированной длины независимо от границ входных и выходных блоков.
Длина входных записей задаётся операндом
.Cm cbs .
Любые конечные пробелы отбрасываются, и в конец добавляется символ новой строки.
.El
.El
.Pp
В местах, где указываются размеры или скорость, ожидается десятичное, восьмеричное или шестнадцатеричное количество байт.
Если число оканчивается символом
.Dq Li b ,
.Dq Li k ,
.Dq Li m ,
.Dq Li g ,
.Dq Li t ,
.Dq Li p
или
.Dq Li w ,
число умножается на 512, 1024 (1K), 1048576 (1M), 1073741824 (1G), 1099511627776 (1T), 1125899906842624 (1P) или на количество байт в машинном целом числе соответственно.
Два или более чисел могут быть разделены символом
.Dq Li x
для обозначения произведения.
.Pp
После завершения работы
.Nm
выводит количество полных и частичных входных и выходных блоков, усечённых входных записей и блоков с нечётной длиной для перестановки байт в стандартный поток ошибок.
Частичный входной блок — это блок, при чтении которого было считано меньше байт, чем размер входного блока.
Частичный выходной блок — это блок, при записи которого было записано меньше байт, чем размер выходного блока.
Частичные выходные блоки на устройства магнитных лент считаются фатальными ошибками.
В остальных случаях остальная часть блока будет записана.
При записи частичных выходных блоков на символьные устройства будет выведено предупреждающее сообщение.
Усечённый входной блок — это блок, для которого было указано ориентированное на записи переменной длины значение преобразования, а входная строка оказалась слишком длинной, чтобы поместиться в запись преобразования, или не завершалась символом новой строки.
.Pp
Обычно данные, полученные в результате ввода, преобразования или того и другого вместе, объединяются в выходные блоки указанного размера.
После достижения конца входного потока любые оставшиеся выходные данные записываются в виде блока.
Это означает, что последний выходной блок может быть короче размера выходного блока.
.Pp
Если утилита
.Nm
получает сигнал
.Dv SIGINFO
(см. аргумент
.Cm status
утилиты
.Xr stty 1 ) ,
текущее количество входных и выходных блоков будет записано в стандартный поток ошибок в том же формате, что и стандартное сообщение о завершении работы.
Если утилита
.Nm
получает сигнал
.Dv SIGINT ,
текущее количество входных и выходных блоков будет записано в стандартный поток ошибок в том же формате, что и стандартное сообщение о завершении работы, после чего утилита
.Nm
завершит работу.
.Sh СТАТУС ЗАВЕРШЕНИЯ
Утилита
.Nm
завершает работу с кодом 0 при успешном выполнении и >0 при возникновении ошибки.
.Sh ПРИМЕРЫ
Проверить, что диск не содержит повреждённых блоков:
.Pp
.Dl "dd if=/dev/ada0 of=/dev/null bs=1m"
.Pp
Выполнить обновление (перезапись) диска, чтобы предотвратить перерастание текущих восстанавливаемых ошибок чтения в невосстановимые:
.Pp
.Dl "dd if=/dev/ada0 of=/dev/ada0 bs=1m"
.Pp
Удалить бит чётности из файла:
.Pp
.Dl "dd if=file conv=parnone of=file.txt"
.Pp
Проверить файл на наличие ошибок (чётного) контроля чётности:
.Pp
.Dl "dd if=file conv=pareven | cmp -x - file"
.Pp
Для создания образа компакт-диска Mode-1 CD-ROM (часто используемого формата для компакт-дисков с данными) используйте размер блока 2048 байт:
.Pp
.Dl "dd if=/dev/cd0 of=filename.iso bs=2048"
.Pp
Записать образ файловой системы на USB-накопитель, при необходимости дополнив конец нулями до границы в 1 МиБ:
.Pp
.Dl "dd if=memstick.img of=/dev/da0 bs=1m conv=noerror,sync"
.Sh СМ. ТАКЖЕ
.Xr cp 1 ,
.Xr mt 1 ,
.Xr recoverdisk 1 ,
.Xr tr 1 ,
.Xr geom 4 ,
.Xr trim 8
.Sh СТАНДАРТЫ
Ожидается, что утилита
.Nm
является надмножеством стандарта
.St -p1003.2 .
Операнды
.Cm files
и
.Cm status ,
а также значения
.Cm ascii ,
.Cm ebcdic ,
.Cm ibm ,
.Cm oldascii ,
.Cm oldebcdic
и
.Cm oldibm
являются расширениями стандарта
.Tn POSIX .
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.At v5 .
.Sh ОШИБКИ
Механизмы защиты в подсистеме
.Xr geom 4
могут препятствовать суперпользователю в записи блоков на диск.
Инструкции по временному отключению этих механизмов защиты можно найти на справочной странице
.Xr geom 4 .
