AAlx0451/freebsd-manpages-ru/usr/src/bin/kenv/kenv.1
.\"-
.\" Copyright (c) 2000  Peter Wemm <peter@FreeBSD.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 20, 2021
.Dt KENV 1
.Os
.Sh ИМЯ
.Nm kenv
.Nd вывод или изменение окружения ядра
.Sh СИНТАКСИС
.Nm
.Op Fl l | s
.Op Fl hNq
.Nm
.Op Fl qv
.Ar переменная Ns Op = Ns Ar значение
.Nm
.Op Fl q
.Fl u
.Ar переменная
.Sh ОПИСАНИЕ
Утилита
.Nm
без аргументов выводит список всех переменных в окружении ядра.
.Pp
Если указан параметр
.Fl l ,
то вместо этого будет выведено статическое окружение, предоставленное
.Xr loader 8 .
Аналогично, параметр
.Fl s
выведет статическое окружение, определённое конфигурацией ядра.
Оба параметра
.Fl l
и
.Fl s
зависят от того, настроено ли ядро на сохранение ранних окружений ядра.
Конфигурация ядра по умолчанию не сохраняет эти окружения.
.Pp
Если указан параметр
.Fl h ,
вывод будет ограничен подсказками (hints) для обнаружения устройств (probe hints).
Если указано необязательное имя
.Ar переменной ,
.Nm
выведет только её значение.
Если указан параметр
.Fl N ,
.Nm
будет выводить только имена переменных без их значений.
Если указан параметр
.Fl u ,
.Nm
удалит указанную переменную окружения.
Если после переменной окружения указано необязательное
.Ar значение ,
.Nm
установит переменную окружения в это значение.
.Pp
Если установлен параметр
.Fl q ,
предупреждения, обычно выводимые в случае невозможности выполнить запрошенную операцию, будут подавлены.
.Pp
Если установлен параметр
.Fl v ,
при выполнении
.Nm
с именем переменной будет выводиться также имя переменной окружения вместе со значением.
.Pp
Переменные могут быть добавлены в окружение ядра с помощью файла
.Pa /boot/loader.conf ,
а также статически скомпилированы в ядро с помощью оператора
.Pp
.Dl Ic env Ar имя_файла
.Pp
в файле конфигурации ядра.
Файл может содержать строки вида
.Pp
.Dl name = "value"  # это комментарий
.Pp
где пробельные символы вокруг
.Sq name
и
.Sq = ,
а также всё после символа
.Sq #
игнорируются.
Почти любой печатный символ, кроме
.Sq =
допустим в имени.
Кавычки необязательны и необходимы только в том случае, если значение содержит пробелы.
.Sh ПРИМЕРЫ
Показать имена переменных с подсказками для обнаружения устройств и отфильтровать для устройства uart:
.Bd -literal -offset indent
$ kenv -h -N | grep uart
hint.uart.0.at
hint.uart.0.flags
hint.uart.0.irq
hint.uart.0.port
hint.uart.1.at
hint.uart.1.irq
hint.uart.1.port
.Ed
.Pp
Показать значение конкретной переменной:
.Bd -literal -offset indent
$ kenv hint.uart.1.at
isa
.Ed
.Pp
То же, что выше, но с добавлением имени переменной в вывод:
.Bd -literal -offset indent
$ kenv -v hint.uart.1.at
hint.uart.1.at="isa"
.Ed
.Pp
Попытаться удалить переменную и подавить предупреждения:
.Bd -literal -offset indent
$ kenv -q -u hint.uart.1.at
.Ed
.Pp
Установить значение переменной
.Ev verbose_loading :
.Bd -literal -offset indent
$ kenv verbose_loading="YES"
verbose_loading="YES"
.Ed
.Sh СМ. ТАКЖЕ
.Xr kenv 2 ,
.Xr config 5 ,
.Xr loader.conf 5 ,
.Xr loader 8
.Sh ИСТОРИЯ
Утилита
.Nm
появилась в
.Fx 4.1.1 .
