AAlx0451/freebsd-manpages-ru/usr/src/bin/kenv/kenv.1

.\"-
.\" Copyright (c) 2000  Peter Wemm <peter@FreeBSD.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd 20 июня 2021
.Dt KENV 1
.Os
.Sh ИМЯ
.Nm kenv
.Nd вывод и изменение параметров окружения ядра
.Sh СИНТАКСИС
.Nm
.Op Fl l | s
.Op Fl hNq
.Nm
.Op Fl qv
.Ar переменная Ns Op = Ns Ar значение
.Nm
.Op Fl q
.Fl u
.Ar переменная
.Sh ОПИСАНИЕ
Если утилита
.Nm
вызвана без аргументов, она выводит список всех переменных окружения ядра.
.Pp
Если указана опция
.Fl l ,
будет выведено статическое окружение, предоставленное загрузчиком
.Xr loader 8 .
Аналогично, опция
.Fl s
выводит статическое окружение, определенное в конфигурации ядра.
Обе опции зависят от того, было ли ядро собрано с поддержкой сохранения параметров раннего окружения.
В конфигурации ядра по умолчанию сохранение этих данных отключено.
.Pp
Если указана опция
.Fl h ,
вывод будет ограничен подсказками ядра для опроса устройств.
Если указано имя конкретной
.Ar переменной ,
.Nm
выведет только её значение.
Если указана опция
.Fl N ,
.Nm
выведет только имена переменных без их значений.
При использовании опции
.Fl u
указанная переменная окружения будет удалена.
Если после имени переменной указано
.Ar значение ,
утилита установит для этой переменной данное значение.
.Pp
Опция
.Fl q
подавляет вывод предупреждений, которые обычно появляются, если запрошенную операцию не удалось выполнить.
.Pp
Если установлена опция
.Fl v
и утилита вызвана с именем конкретной переменной, то вместе со значением будет выведено и имя этой переменной.
.Pp
Переменные могут быть добавлены в окружение ядра через файл
.Pa /boot/loader.conf
или вкомпилированы в ядро статически с помощью инструкции
.Pp
.Dl Ic env Ar имя_файла
.Pp
в конфигурационном файле ядра. Этот файл может содержать строки вида:
.Pp
.Dl имя = "значение"  # это комментарий
.Pp
Пробелы вокруг
.Sq имя
и знака
.Sq = ,
а также всё, что следует за символом
.Sq # ,
игнорируется. В качестве части имени допускается практически любой печатный символ, кроме
.Sq = .
Кавычки не обязательны и требуются только в том случае, если значение содержит пробелы.
.Sh ПРИМЕРЫ
Вывести имена переменных из подсказок ядра и отфильтровать их по устройству uart:
.Bd -literal -offset indent
$ kenv -h -N | grep uart
hint.uart.0.at
hint.uart.0.flags
hint.uart.0.irq
hint.uart.0.port
hint.uart.1.at
hint.uart.1.irq
hint.uart.1.port
.Ed
.Pp
Показать значение конкретной переменной:
.Bd -literal -offset indent
$ kenv hint.uart.1.at
isa
.Ed
.Pp
То же самое, но с выводом имени переменной:
.Bd -literal -offset indent
$ kenv -v hint.uart.1.at
hint.uart.1.at="isa"
.Ed
.Pp
Попытаться удалить переменную, подавляя возможные предупреждения:
.Bd -literal -offset indent
$ kenv -q -u hint.uart.1.at
.Ed
.Pp
Установить значение переменной
.Ev verbose_loading :
.Bd -literal -offset indent
$ kenv verbose_loading="YES"
verbose_loading="YES"
.Ed
.Sh СМ. ТАКЖЕ
.Xr kenv 2 ,
.Xr config 5 ,
.Xr loader.conf 5 ,
.Xr loader 8
.Sh ИСТОРИЯ
Утилита
.Nm
впервые появилась в
.Fx 4.1.1 .
