AAlx0451/freebsd-manpages-ru/usr/src/bin/hostname/hostname.1
.\"-
.\" Copyright (c) 1983, 1988, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 5, 2020
.Dt HOSTNAME 1
.Os
.Sh ИМЯ
.Nm hostname
.Nd установка или вывод имени текущей хост-системы
.Sh СИНТАКСИС
.Nm
.Op Fl f
.Op Fl s | d
.Op Ar имя-хоста
.Sh ОПИСАНИЕ
Утилита
.Nm
выводит имя текущего хоста.
Суперпользователь может установить имя хоста, указав аргумент; обычно это делается в
инициализационном скрипте
.Pa /etc/rc.d/hostname ,
который запускается при загрузке системы.
Этот скрипт использует переменную
.Va hostname
в файле
.Pa /etc/rc.conf .
.Pp
Параметры:
.Bl -tag -width flag
.It Fl f
Включать доменную информацию в выводимое имя.
Это поведение по умолчанию.
.It Fl s
Отбросить любую доменную информацию из выводимого имени.
.It Fl d
Выводить только доменную информацию.
.El
.Sh ПРИМЕРЫ
Установить имя хоста машины и проверить результат:
.Bd -literal -offset indent
$ hostname beastie.localdomain.org
$ hostname
beastie.localdomain.org
.Ed
.Pp
Не показывать доменную информацию:
.Bd -literal -offset indent
$ hostname -s
beastie
.Ed
.Pp
Показать только доменную информацию:
.Bd -literal -offset indent
$ hostname -d
localdomain.org
.Ed
.Sh СМ. ТАКЖЕ
.Xr gethostname 3 ,
.Xr rc.conf 5
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.Bx 4.2 .
